tests/hartmann/mhdCentralFoam/Ha=5/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include        "../system/geometryAndProperties"
#include        "include/initialConditions"

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type               pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value              uniform (0 0 0);
    }

    outlet
    {
        type               pressureInletOutletVelocity;
        tangentialVelocity uniform (0 0 0);
        value              uniform (0 0 0);
    }

    lowerWall
    {
        type            noSlip;
    }

    upperWall
    {
        type            noSlip;
    }

    frontAndBack
    {
        type            empty;
    }
}

// ************************************************************************* //
